In [1]:
import pandas as pd
import numpy as np

In [14]:
am1={"name":['Alice','Bob','Claire'],
     "Age":[25,30,27],
     "Gender":['Female','Male','Female']
    
}

In [15]:
df=pd.DataFrame(am1)

In [16]:
df

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [24]:
df.to_csv('am1.csv',index=False)

AttributeError: 'dict' object has no attribute 'csv'